espruino/Espruino/targets/esp32/jshardware.c
JsVarFloat jshPinAnalog(Pin pin) {
#if ESP_IDF_VERSION_MAJOR >= 5
  jsError("jshPinAnalog(Pin pin) is not implemented yet");
  return NAN;
#else
  if (pinInfo[pin].analog == JSH_ANALOG_NONE)
    return NAN;
  JsVarFloat v = (JsVarFloat) readADC(pin) / 4096;
  if (pinInfo[pin].port & JSH_PIN_NEGATED) v=1-v;
  return v;
#endif
}


int jshPinAnalogFast(Pin pin) {
#if ESP_IDF_VERSION_MAJOR >= 5
  jsError("jshPinAnalogFast(Pin pin) is not implemented yet");
  return NAN;
#else
  if (pinInfo[pin].analog == JSH_ANALOG_NONE)
    return 0;
  int v = readADC(pin) << 4;
  if (pinInfo[pin].port & JSH_PIN_NEGATED) v=65535-v;
  return v;
#endif
}


/**
 * Set the output PWM value.
 */
JshPinFunction jshPinAnalogOutput(Pin pin,
    JsVarFloat value,
    JsVarFloat freq,
    JshAnalogOutputFlags flags) { // if freq<=0, the default is used
  UNUSED(flags);
  if (pinInfo[pin].port & JSH_PIN_NEGATED) value=1-value;
  if (value<0) value=0;
  if (value>1) value=1;
  if (!isfinite(freq)) freq=0;
  if(pin == 25 || pin == 26){
  if(flags & (JSAOF_ALLOW_SOFTWARE | JSAOF_FORCE_SOFTWARE)) jsError("pin does not support software PWM");
    writeDAC(pin,(uint8_t)(value * 255));
  }
  else{
  if(flags & JSAOF_ALLOW_SOFTWARE){
    if (!jshGetPinStateIsManual(pin)){
        BITFIELD_SET(jshPinSoftPWM, pin, 0);
        jshPinSetState(pin, JSHPINSTATE_GPIO_OUT);
      }
      BITFIELD_SET(jshPinSoftPWM, pin, 1);
      if ((freq<=0)) freq=50;
      jstPinPWM(freq, value, pin);
      return 0;
    }
    else writePWM(pin,( uint16_t)(value * PWMTimerRange),(int) freq);
  }
  return 0;
}


/**
 *
 */
void jshSetOutputValue(JshPinFunction func, int value) {
  int pin;
  if (JSH_PINFUNCTION_IS_DAC(func)) {
    uint8_t val = (uint8_t)(value >> 8);
    switch (func & JSH_MASK_INFO) {
      case JSH_DAC_CH1:  writeDAC(25,val); break;
      case JSH_DAC_CH2:  writeDAC(26,val); break;
    }
  }
  else{
    pin = ((func >> JSH_SHIFT_INFO) << 4) + ((func >> JSH_SHIFT_TYPE) & 15);
    // convert the 16 bit value to a 10 bit value.
    value=value >> (16 - PWMTimerBit);
    setPWM( (Pin)pin, (uint16_t)value);
  }
}

void jshEnableWatchDog(JsVarFloat timeout) {
#ifndef CONFIG_ESP_TASK_WDT_EN
  return;
#else
#ifdef QEMU_BUILD
#else
  wdt_enabled = true;
#if ESP_IDF_VERSION_MAJOR >= 5
  // ESP-IDF 5 uses a config struct
  esp_task_wdt_config_t wdt_config = {
      .timeout_ms = (int)(timeout * 1000 + 0.5), // convert seconds to milliseconds
  };
  esp_task_wdt_init(&wdt_config);
#else
  // ESP-IDF 4 compatibility
  esp_task_wdt_init((int)(timeout + 0.5), true);
#endif
  esp_task_wdt_add(NULL); // add current thread to WDT watch
#endif
#endif
}
// Kick the watchdog
void jshKickWatchDog() {
#ifndef CONFIG_ESP_TASK_WDT_EN
  return;
#else

#ifdef ESPR_DISABLE_KICKWATCHDOG_PIN // if this pin is asserted, don't kick the watchdog
  if (jshPinGetValue(ESPR_DISABLE_KICKWATCHDOG_PIN)) return;
#endif
  if (wdt_enabled)
    esp_task_wdt_reset();
#endif
}


/**
 * Get the state of the pin associated with the event flag.
 */
bool CALLED_FROM_INTERRUPT jshGetWatchedPinState(IOEventFlags eventFlag) { // can be called at interrupt time
  gpio_num_t gpioNum = pinToESP32Pin((Pin)(eventFlag-EV_EXTI0));
  bool value = gpio_get_level(gpioNum);
  if (pinInfo[gpioNum].port & JSH_PIN_NEGATED) value=!value;
  return value;
}


/**
 * Determine whether the pin can be watchable.
 * \return Returns true if the pin is watchable.
 */
bool jshCanWatch(
    Pin pin //!< The pin that we are asking whether or not we can watch it.
  ) {
#ifdef CONFIG_IDF_TARGET_ESP32C3
  return (pin!=18) && (pin!=19); // USB
#else
  return !( pin >= 6 && pin <= 12 /*SPI FLASH*/);
#endif
}


/**
 * Do what ever is necessary to watch a pin.
 * \return The event flag for this pin.
 */
IOEventFlags jshPinWatch(
      Pin pin,          //!< The pin to be watched.
      bool shouldWatch, //!< True for watching and false for unwatching.
      JshPinWatchFlags flags
    ) {
  gpio_num_t gpioNum = pinToESP32Pin(pin);
  if(shouldWatch){
    gpio_set_intr_type(gpioNum,GPIO_INTR_ANYEDGE);             //set posedge interrupt
    gpio_set_direction(gpioNum,GPIO_MODE_INPUT);               //set as input
    gpio_set_pull_mode(gpioNum,GPIO_PULLUP_ONLY);              //enable pull-up mode
    gpio_intr_enable(gpioNum);                                 //enable interrupt
    return pinToEV_EXTI(gpioNum);
  } else{
    if(gpio_intr_disable(gpioNum) == ESP_ERR_INVALID_ARG){     //disable interrupt
        jsError("*** jshPinWatch error");
    }
  }
  return EV_NONE;
}


/**
 *
 */
JshPinFunction jshGetCurrentPinFunction(Pin pin) {
  if (jshIsPinValid(pin)) {
    int i;
    for (i=0;i<JSH_PININFO_FUNCTIONS;i++) {
      JshPinFunction func = pinInfo[pin].functions[i];
      if (JSH_PINFUNCTION_IS_TIMER(func) ||
          JSH_PINFUNCTION_IS_DAC(func))
        return func;
    }
  }
  return JSH_NOTHING;
}


/**
 * Determine if a given event is associated with a given pin.
 * \return True if the event is associated with the pin and false otherwise.
 */
bool jshIsEventForPin(
    IOEventFlags eventFlags, //!< The event type that has been detected.
    Pin pin         //!< The identity of a pin.
  ) {
  return IOEVENTFLAGS_GETTYPE(eventFlags) == pinToEV_EXTI(pin);
}

//===== USART and Serial =====



void jshUSARTSetup(IOEventFlags device, JshUSARTInfo *inf) {
  if (inf->errorHandling) {
    jsExceptionHere(JSET_ERROR, "ESP32 Espruino builds can't handle framing/parity errors (errors:true)");
    return;
  }
  initSerial(device, inf);
}

void jshUSARTUnSetup(IOEventFlags device) {
  uninitSerial(device);
}

bool jshIsUSBSERIALConnected() {
#ifdef ESPR_USE_USB_SERIAL_JTAG
  return usb_serial_jtag_is_driver_installed() && usb_serial_jtag_is_connected();
#else
  return false; // "On non-USB boards this just returns false"
#endif
}

/**
 * Kick a device into action (if required).
 *
 */
void jshUSARTKick(IOEventFlags device) {
  // ignore - the `uartTask` handles all this now in pollSerialDevices
}

//===== System time stuff =====

/**
 * Given a time in milliseconds as float, get us the value in microsecond
 */
JsSysTime jshGetTimeFromMilliseconds(JsVarFloat ms) {
  return (JsSysTime) (ms * 1000.0);
}

/**
 * Given a time in microseconds, get us the value in milliseconds (float)
 */
JsVarFloat jshGetMillisecondsFromTime(JsSysTime time) {
  return (JsVarFloat) time / 1000.0;
}


/**
 * Return the current time in microseconds.
 */
static portMUX_TYPE JSmicrosMux = portMUX_INITIALIZER_UNLOCKED;
JsSysTime CALLED_FROM_INTERRUPT jshGetSystemTime() { // in us -- can be called at interrupt time
  struct timeval tm;
  portENTER_CRITICAL_ISR(&JSmicrosMux);
  gettimeofday(&tm, 0);
  portEXIT_CRITICAL_ISR(&JSmicrosMux);
  return (JsSysTime)(tm.tv_sec)*1000000L + tm.tv_usec;
}

/**
 * Set the current time in microseconds.
 */
void jshSetSystemTime(JsSysTime newTime) {
  struct timeval tm;
  struct timezone tz;

